/***************************************************/
/*              Лаборатордук иш №8                 */
/*             Текст файлды иштетүү                */
/*                  20-Вариант                     */
/***************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

char filename[80];       /* файлдын ысымы */
char buf1[81], buf2[81]; /* кирүү жана чыгуу буферлери */

int main(int par1, char *par2[])
{
    char *k1, *k2;    /* буфердеги учурдагы көрсөткүчтөр */
    char s;           /* алдынкы символ */
    FILE *inf, *outf; /* файлдык өзгөрмөлөр */
    int as;           /* ачык символдордун саны */

    /* параметрлерди текшерүү */
    if (par1 < 2)
    {
        printf("Чакыруу параметри берилген жок!\n");
        exit(0);
    }
    strcpy(filename, par2[1]);
    /* файлдарды ачуу */
    if ((inf = fopen(filename, "r")) == NULL)
    {
        printf("%s - файлын ачууга мүмкүн эмес! \n", filename);
        exit(0);
    }
    if ((outf = fopen("TMP", "w")) == NULL)
    {
        printf("Убактылуу файлды түзүүгө мүмкүн эмес!\n");
        exit(0);
    }
    /* 1-фаза – ашык ачык символдорун эсептөө жана өчүрүү */
    /* файлдан саптарды окуп алуу */
    for (; fgets(buf1, 80, inf) != NULL;)
    {
        /* ашык ачык символдорун өчүрүү жана саноо */
        for (s = ' ', as = 0, k1 = buf1, k2 = buf2; *k1; s = *k1++)
        {
            switch (*k1)
            {
                case '\n': /* жаңы сапка өтүү символу өчүрүлөт */
                    break;
                case ' ': /*экинчи ачык символу жоюлат */
                    if (s == ' '){
                        as++;
                        break;
                    }   
                default: /* калган символдор көчүрүлөт */
                    *k2++ = *k1;
                    break;
            }
        }
        /* сап аягындагы ачык символун өчүрүү жана саноо */
        if ((k2 >= buf2) && (*(k2 - 1) == ' ')) {
            *(k2 - 1) = 0;
            as++;
        }
        else
            *k2 = 0;
        /* файлга ашык ачык символдорунун санын жана сапты чыгаруу */
        fprintf(outf, "%02d %s\n", as, buf2);
    }
    fclose(inf);
    fclose(outf);

    /* 2-фаза */
    /* файлдарды ачуу */
    if ((inf = fopen("TMP", "r")) == NULL)
    {
        printf("Убактылуу файлды ачууга мүмкүн эмес \n");
        exit(0);
    }
    if ((outf = fopen(filename, "w")) == NULL)
    {
        printf("%s –файлын ачууга мүмкүн эмес\n", filename);
        exit(0);
    }
    /* файлдагы саптарды окуп алуу */
    while (fgets(buf1, 80, inf) != NULL)
    {
        /* ашык ачык символдорунун санын жана сапты ажыратып алуу */
        buf1[2] = 0;
        as = atoi(buf1);
        k1 = buf1 + 3;
        k1[strlen(k1) - 1] = 0;
        /* эгер ашык ачык символдорунун саны 0 болсо, сап ошол бойдон калат */
        if (as > 0)
        {
            k2 = buf2;
            /* саптын башына ашык ачык символдорун кошуу */
            while(as--) *k2++ = ' ';
            /* сапты копиялоо */
            while(*k1) *k2++ = *k1++;
            /* чыгуу буфердеги саптын аягы белгиси */
            *k2 = 0;
            /* файлга чыгаруу */
            fprintf(outf, "%s\n", buf2);
        }
        /* өзгөртүлбөгөн сапты чыгаруу */
        else
            fprintf(outf, "%s\n", k1);
    }
    fclose(inf);
    fclose(outf);
    /* убактылуу файлды өчүрүү */
    unlink("TMP");

    return 0;
}